18FW/system/forcesIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forcesIncompressible
{
    type            forces;

    functionObjectLibs            ("libforces.so");

    enabed          true;
    log             yes;
	
	writeControl    timeStep;
	writeInterval   1;

  patches         (FW FLWh);
	pName           p;
	Uname           U;
	
	rho              rhoInf;
    rhoInf            1.225;
	
    CofR            (-1.07 0 0);  // 1/4 Chord 
}


// ************************************************************************* //